In [1]:
import pandas as pd

In [3]:
JOB = pd.read_csv('lv2-2508.csv')

In [4]:
JOB.shape

(6000, 6)

In [5]:
JOB.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
0     1            B  174350    Senior       Remote         M
1     2            B  155000    Senior     Inperson         M
2     3            B  120500    Senior       Remote         M
3     4            A  258000    Senior     Inperson         M
4     5            G  280100    Senior       Remote         M

# Q21

# Step 21-1

In [6]:
DF11 = JOB[JOB['JOB_CATEGORY'] == 'A']

In [7]:
DF11.shape

(2008, 6)

# Step 21-2

In [8]:
DF11.head()

    E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
3      4            A  258000    Senior     Inperson         M
9     10            A  187259    Senior     Inperson         M
12    13            A  297300    Senior       Remote         M
19    20            A  100000    Senior     Inperson         M
21    22            A  130000    Senior       Remote         M

In [9]:
SAL_Q1 = DF11['SALARY'].quantile(q=0.25)
SAL_Q3 = DF11['SALARY'].quantile(q=0.75)

In [10]:
SAL_Q1, SAL_Q3

(np.float64(136000.0), np.float64(210000.0))

# Step 21-3

In [13]:
DF12 = DF11.pivot_table(index=['EXP_LEVEL', 'WORK_SETTING', 'COMP_SIZE'], values=['E_ID', 'SALARY'], aggfunc=['count', 'mean']).reset_index()

In [15]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE count                mean
                                      E_ID SALARY         E_ID         SALARY
0  Entrylevel     Inperson         L     7      7  2363.714286  157734.285714
1  Entrylevel     Inperson         M    51     51  3391.039216  131638.019608
2  Entrylevel       Remote         M    20     20  3015.500000  115269.800000
3   Executive     Inperson         L     2      2  4966.500000  206250.000000
4   Executive     Inperson         M    29     29  3064.827586  221239.655172

In [16]:
DF12.columns=['EXP_LEVEL', 'WORK_SETTING', 'COMP_SIZE', 'E_CNT', '_1', '_2', 'SAL_AVG']

In [17]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT  _1           _2        SAL_AVG
0  Entrylevel     Inperson         L      7   7  2363.714286  157734.285714
1  Entrylevel     Inperson         M     51  51  3391.039216  131638.019608
2  Entrylevel       Remote         M     20  20  3015.500000  115269.800000
3   Executive     Inperson         L      2   2  4966.500000  206250.000000
4   Executive     Inperson         M     29  29  3064.827586  221239.655172

In [18]:
DF12 = DF12.drop(columns=['_1', '_2'])

In [19]:
DF12.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
0  Entrylevel     Inperson         L      7  157734.285714
1  Entrylevel     Inperson         M     51  131638.019608
2  Entrylevel       Remote         M     20  115269.800000
3   Executive     Inperson         L      2  206250.000000
4   Executive     Inperson         M     29  221239.655172

# 21-4

In [20]:
DF_HIGH = DF12[DF12['SAL_AVG'] >= SAL_Q3]

In [21]:
DF_LOW = DF12[DF12['SAL_AVG'] <= SAL_Q1]

In [22]:
DF_HIGH.shape

(1, 5)

In [23]:
DF_LOW.shape

(2, 5)

In [24]:
DF_HIGH.head()

   EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
4  Executive     Inperson         M     29  221239.655172

In [26]:
DF_LOW.head()

    EXP_LEVEL WORK_SETTING COMP_SIZE  E_CNT        SAL_AVG
1  Entrylevel     Inperson         M     51  131638.019608
2  Entrylevel       Remote         M     20  115269.800000

In [28]:
high_res = (29 * 221239.655172) / 29
low_res = (51 * 131638.019608 + 20 * 115269.800000) / (51 + 20)

# Q21 Answer

In [29]:
round(abs(high_res - low_res), 1)

94212.4

# Q22

In [30]:
df_22 = JOB.copy()

In [31]:
df_22.shape

(6000, 6)

In [32]:
df_22.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE
0     1            B  174350    Senior       Remote         M
1     2            B  155000    Senior     Inperson         M
2     3            B  120500    Senior       Remote         M
3     4            A  258000    Senior     Inperson         M
4     5            G  280100    Senior       Remote         M

In [37]:
df_22['EXP_LEVEL'].value_counts()

EXP_LEVEL
Senior        4621
Midlevel       978
Entrylevel     213
Executive      188
Name: count, dtype: int64

# Step 22-1

In [41]:
exps = []

for exp in df_22['EXP_LEVEL']:
    if (exp == 'Entrylevel') | (exp == 'Midlevel'):
        exps.append('L')
    else:
        exps.append('H')

In [43]:
df_22['EXP'] = exps

In [44]:
df_22.head()

   E_ID JOB_CATEGORY  SALARY EXP_LEVEL WORK_SETTING COMP_SIZE EXP
0     1            B  174350    Senior       Remote         M   H
1     2            B  155000    Senior     Inperson         M   H
2     3            B  120500    Senior       Remote         M   H
3     4            A  258000    Senior     Inperson         M   H
4     5            G  280100    Senior       Remote         M   H

# Step 22-2

In [57]:
cats = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [58]:
res = []

for cat in cats:
    
    tmp = abs()

TypeError: abs() takes exactly one argument (0 given)